In [1]:
import pandas as pd

In [2]:
#help(pd.DataFrame())

In [3]:
df1 = pd.DataFrame({ 'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Mary', 'Julian', 'Rosie'],
                   'Height':[180, 165, 170, 164, 163, 175, 166],
                   'Weight': [85, 65, 68, 45, 43, 72, 46],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood'],
                   'Sex': ['m', 'f', 'm', 'f', 'f', 'm', 'f']})

In [4]:
df1

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f

### describe our data using .decribe()

In [5]:
df1.describe()

           Height     Weight
count    7.000000   7.000000
mean   169.000000  60.571429
std      6.377042  16.154021
min    163.000000  43.000000
25%    164.500000  45.500000
50%    166.000000  65.000000
75%    172.500000  70.000000
max    180.000000  85.000000

### Get variables ( columns) using .columns

In [6]:
df1.columns

Index(['Names', 'Height', 'Weight', 'Pref_food', 'Sex'], dtype='object')

### Set the names column as index

In [7]:
df1.set_index('Names')

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f
Julian      175      72       steak   m
Rosie       166      46     seafood   f

### to consolidate index use inplace = True when setting index

In [8]:
df1.set_index('Names', inplace=True)

In [9]:
df1

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f
Julian      175      72       steak   m
Rosie       166      46     seafood   f

### reset index using reset_index() method

In [10]:
df1.reset_index()

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f

### check the number of variables and cases

In [11]:
df1.shape

(7, 4)

In [12]:
print(df1.dtypes)

Height        int64
Weight        int64
Pref_food    object
Sex          object
dtype: object

In [13]:
df1.head()

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f

In [14]:
df1.tail(3)

        Height  Weight   Pref_food Sex
Names
Mary       163      43  vegetables   f
Julian     175      72       steak   m
Rosie      166      46     seafood   f

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Simon to Rosie
Data columns (total 4 columns):
Height       7 non-null int64
Weight       7 non-null int64
Pref_food    7 non-null object
Sex          7 non-null object
dtypes: int64(2), object(2)
memory usage: 280.0+ bytes

### rearrange data frame by a variable

In [16]:
df1.sort_values(by ='Weight')

         Height  Weight   Pref_food Sex
Names
Mary        163      43  vegetables   f
Laura       164      45       pizza   f
Rosie       166      46     seafood   f
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Julian      175      72       steak   m
Simon       180      85       steak   m

### sort descending

In [17]:
df1.sort_values(by ='Weight', ascending = False)

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Julian      175      72       steak   m
Francis     170      68       pasta   m
Kate        165      65       pizza   f
Rosie       166      46     seafood   f
Laura       164      45       pizza   f
Mary        163      43  vegetables   f

### Slice Dataframe

In [18]:
df1[:3]

         Height  Weight Pref_food Sex
Names
Simon       180      85     steak   m
Kate        165      65     pizza   f
Francis     170      68     pasta   m

In [19]:
df1[4:]

        Height  Weight   Pref_food Sex
Names
Mary       163      43  vegetables   f
Julian     175      72       steak   m
Rosie      166      46     seafood   f

In [21]:
df1 = df1.reset_index()

In [22]:
df1['Names']

0      Simon
1       Kate
2    Francis
3      Laura
4       Mary
5     Julian
6      Rosie
Name: Names, dtype: object

In [23]:
df1.Names

0      Simon
1       Kate
2    Francis
3      Laura
4       Mary
5     Julian
6      Rosie
Name: Names, dtype: object

### Use double square bracket to select data frame

In [24]:
df1[['Names']]

     Names
0    Simon
1     Kate
2  Francis
3    Laura
4     Mary
5   Julian
6    Rosie

### Select more columns

In [25]:
df1[['Names', 'Sex']]

     Names Sex
0    Simon   m
1     Kate   f
2  Francis   m
3    Laura   f
4     Mary   f
5   Julian   m
6    Rosie   f

### Select value of particular variable

In [26]:
df1['Sex'][2] #Third value of 'Sex'

'm'

In [27]:
df1['Names'][1:4]

1       Kate
2    Francis
3      Laura
Name: Names, dtype: object